#-- coding: utf-8 --

"""
	Номер зачетной книжки 21-676
	Автор: Кузьмин Илья Викторович
	Дата: 26.01.2022
	Задание 2. Вывести на экран остаток от деления 16823 * 12302 / 3092.
"""

print ("Остаток от деления выражения 16823 * 12302 / 3092 = ",16823 * 12302 % 3092)
